; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph1 - mode
	infrared2 - mode
	thermograph3 - mode
	thermograph0 - mode
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star0 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 129)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 141)
	(= (data Star5 spectrograph1) 145)
	(= (data Phenomenon6 spectrograph1) 230)
	(= (data Star7 spectrograph1) 213)
	(= (data Phenomenon8 spectrograph1) 119)
	(= (data Phenomenon9 spectrograph1) 11)
	(= (data Phenomenon10 spectrograph1) 288)
	(= (data Star5 infrared2) 219)
	(= (data Phenomenon6 infrared2) 29)
	(= (data Star7 infrared2) 96)
	(= (data Phenomenon8 infrared2) 253)
	(= (data Phenomenon9 infrared2) 145)
	(= (data Phenomenon10 infrared2) 142)
	(= (data Star5 thermograph3) 113)
	(= (data Phenomenon6 thermograph3) 292)
	(= (data Star7 thermograph3) 200)
	(= (data Phenomenon8 thermograph3) 166)
	(= (data Phenomenon9 thermograph3) 158)
	(= (data Phenomenon10 thermograph3) 254)
	(= (data Star5 thermograph0) 9)
	(= (data Phenomenon6 thermograph0) 47)
	(= (data Star7 thermograph0) 287)
	(= (data Phenomenon8 thermograph0) 68)
	(= (data Phenomenon9 thermograph0) 179)
	(= (data Phenomenon10 thermograph0) 75)
	(= (slew_time Star1 Star0) 10.65)
	(= (slew_time Star0 Star1) 10.65)
	(= (slew_time Star2 Star0) 66.55)
	(= (slew_time Star0 Star2) 66.55)
	(= (slew_time Star2 Star1) 9.608)
	(= (slew_time Star1 Star2) 9.608)
	(= (slew_time GroundStation3 Star0) 9.19)
	(= (slew_time Star0 GroundStation3) 9.19)
	(= (slew_time GroundStation3 Star1) 37.65)
	(= (slew_time Star1 GroundStation3) 37.65)
	(= (slew_time GroundStation3 Star2) 15.7)
	(= (slew_time Star2 GroundStation3) 15.7)
	(= (slew_time GroundStation4 Star0) 72.52)
	(= (slew_time Star0 GroundStation4) 72.52)
	(= (slew_time GroundStation4 Star1) 22.81)
	(= (slew_time Star1 GroundStation4) 22.81)
	(= (slew_time GroundStation4 Star2) 1.841)
	(= (slew_time Star2 GroundStation4) 1.841)
	(= (slew_time GroundStation4 GroundStation3) 43.1)
	(= (slew_time GroundStation3 GroundStation4) 43.1)
	(= (slew_time Star5 Star0) 91.08)
	(= (slew_time Star0 Star5) 91.08)
	(= (slew_time Star5 Star1) 3.205)
	(= (slew_time Star1 Star5) 3.205)
	(= (slew_time Star5 Star2) 8.228)
	(= (slew_time Star2 Star5) 8.228)
	(= (slew_time Star5 GroundStation3) 14.2)
	(= (slew_time GroundStation3 Star5) 14.2)
	(= (slew_time Star5 GroundStation4) 5.361)
	(= (slew_time GroundStation4 Star5) 5.361)
	(= (slew_time Phenomenon6 Star0) 5.213)
	(= (slew_time Star0 Phenomenon6) 5.213)
	(= (slew_time Phenomenon6 Star1) 7.032)
	(= (slew_time Star1 Phenomenon6) 7.032)
	(= (slew_time Phenomenon6 Star2) 7.935)
	(= (slew_time Star2 Phenomenon6) 7.935)
	(= (slew_time Phenomenon6 GroundStation3) 19.82)
	(= (slew_time GroundStation3 Phenomenon6) 19.82)
	(= (slew_time Phenomenon6 GroundStation4) 1.016)
	(= (slew_time GroundStation4 Phenomenon6) 1.016)
	(= (slew_time Phenomenon6 Star5) 14.97)
	(= (slew_time Star5 Phenomenon6) 14.97)
	(= (slew_time Star7 Star0) 48.11)
	(= (slew_time Star0 Star7) 48.11)
	(= (slew_time Star7 Star1) 81.23)
	(= (slew_time Star1 Star7) 81.23)
	(= (slew_time Star7 Star2) 25.87)
	(= (slew_time Star2 Star7) 25.87)
	(= (slew_time Star7 GroundStation3) 19.82)
	(= (slew_time GroundStation3 Star7) 19.82)
	(= (slew_time Star7 GroundStation4) 78.43)
	(= (slew_time GroundStation4 Star7) 78.43)
	(= (slew_time Star7 Star5) 45.9)
	(= (slew_time Star5 Star7) 45.9)
	(= (slew_time Star7 Phenomenon6) 25.39)
	(= (slew_time Phenomenon6 Star7) 25.39)
	(= (slew_time Phenomenon8 Star0) 47.22)
	(= (slew_time Star0 Phenomenon8) 47.22)
	(= (slew_time Phenomenon8 Star1) 54.23)
	(= (slew_time Star1 Phenomenon8) 54.23)
	(= (slew_time Phenomenon8 Star2) 10.88)
	(= (slew_time Star2 Phenomenon8) 10.88)
	(= (slew_time Phenomenon8 GroundStation3) 5.022)
	(= (slew_time GroundStation3 Phenomenon8) 5.022)
	(= (slew_time Phenomenon8 GroundStation4) 9.432)
	(= (slew_time GroundStation4 Phenomenon8) 9.432)
	(= (slew_time Phenomenon8 Star5) 41.08)
	(= (slew_time Star5 Phenomenon8) 41.08)
	(= (slew_time Phenomenon8 Phenomenon6) 5.778)
	(= (slew_time Phenomenon6 Phenomenon8) 5.778)
	(= (slew_time Phenomenon8 Star7) 68.61)
	(= (slew_time Star7 Phenomenon8) 68.61)
	(= (slew_time Phenomenon9 Star0) 21.95)
	(= (slew_time Star0 Phenomenon9) 21.95)
	(= (slew_time Phenomenon9 Star1) 84.36)
	(= (slew_time Star1 Phenomenon9) 84.36)
	(= (slew_time Phenomenon9 Star2) 5.915)
	(= (slew_time Star2 Phenomenon9) 5.915)
	(= (slew_time Phenomenon9 GroundStation3) 13.59)
	(= (slew_time GroundStation3 Phenomenon9) 13.59)
	(= (slew_time Phenomenon9 GroundStation4) 79.36)
	(= (slew_time GroundStation4 Phenomenon9) 79.36)
	(= (slew_time Phenomenon9 Star5) 13.31)
	(= (slew_time Star5 Phenomenon9) 13.31)
	(= (slew_time Phenomenon9 Phenomenon6) 16.87)
	(= (slew_time Phenomenon6 Phenomenon9) 16.87)
	(= (slew_time Phenomenon9 Star7) 45.19)
	(= (slew_time Star7 Phenomenon9) 45.19)
	(= (slew_time Phenomenon9 Phenomenon8) 24.75)
	(= (slew_time Phenomenon8 Phenomenon9) 24.75)
	(= (slew_time Phenomenon10 Star0) 54.9)
	(= (slew_time Star0 Phenomenon10) 54.9)
	(= (slew_time Phenomenon10 Star1) 7.926)
	(= (slew_time Star1 Phenomenon10) 7.926)
	(= (slew_time Phenomenon10 Star2) 62)
	(= (slew_time Star2 Phenomenon10) 62)
	(= (slew_time Phenomenon10 GroundStation3) 40.78)
	(= (slew_time GroundStation3 Phenomenon10) 40.78)
	(= (slew_time Phenomenon10 GroundStation4) 60.72)
	(= (slew_time GroundStation4 Phenomenon10) 60.72)
	(= (slew_time Phenomenon10 Star5) 34.58)
	(= (slew_time Star5 Phenomenon10) 34.58)
	(= (slew_time Phenomenon10 Phenomenon6) 5.388)
	(= (slew_time Phenomenon6 Phenomenon10) 5.388)
	(= (slew_time Phenomenon10 Star7) 20.7)
	(= (slew_time Star7 Phenomenon10) 20.7)
	(= (slew_time Phenomenon10 Phenomenon8) 13.27)
	(= (slew_time Phenomenon8 Phenomenon10) 13.27)
	(= (slew_time Phenomenon10 Phenomenon9) 73.74)
	(= (slew_time Phenomenon9 Phenomenon10) 73.74)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star5 infrared2)
	(have_image Phenomenon6 infrared2)
	(have_image Star7 thermograph3)
	(have_image Phenomenon8 thermograph0)
	(have_image Phenomenon9 infrared2)
	(have_image Phenomenon10 spectrograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (turn_to satellite1 phenomenon8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 141 to 93.78, (fuel-used) from 0 to 47.22
   goals met: 0 of 6
4. (turn_to satellite1 groundstation4 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation4)
   changed: (fuel satellite1) from 93.78 to 84.348, (fuel-used) from 47.22 to 56.652
   goals met: 0 of 6
5. (turn_to satellite1 phenomenon6 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 84.348 to 83.332, (fuel-used) from 56.652 to 57.668
   goals met: 0 of 6
6. (turn_to satellite1 phenomenon8 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 83.332 to 77.554, (fuel-used) from 57.668 to 63.446
   goals met: 0 of 6
7. (turn_to satellite1 phenomenon6 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 77.554 to 71.776, (fuel-used) from 63.446 to 69.224
   goals met: 0 of 6
8. (turn_to satellite1 phenomenon8 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 71.776 to 65.998, (fuel-used) from 69.224 to 75.002
   goals met: 0 of 6
9. (turn_to satellite1 groundstation4 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation4)
   changed: (fuel satellite1) from 65.998 to 56.566, (fuel-used) from 75.002 to 84.434
   goals met: 0 of 6
10. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 6
11. (turn_to satellite1 phenomenon8 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon8)
   changed: (fuel satellite1) from 56.566 to 47.134, (fuel-used) from 84.434 to 93.866
   goals met: 0 of 6
12. (take_image satellite1 phenomenon8 instrument1 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   changed: (data_capacity satellite1) from 1000 to 932, (data-stored) from 0 to 68
   goals met: 1 of 6
13. (turn_to satellite1 phenomenon6 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 47.134 to 41.356, (fuel-used) from 93.866 to 99.644
   goals met: 1 of 6
14. (turn_to satellite1 star0 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 41.356 to 36.143, (fuel-used) from 99.644 to 104.857
   goals met: 1 of 6
15. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 1 of 6
16. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 6
17. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 1 of 6
18. (turn_to satellite1 phenomenon6 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 36.143 to 30.93, (fuel-used) from 104.857 to 110.07
   goals met: 1 of 6
19. (take_image satellite1 phenomenon6 instrument2 infrared2)
   added: (have_image phenomenon6 infrared2)
   changed: (data_capacity satellite1) from 932 to 903, (data-stored) from 68 to 97
   goals met: 2 of 6
20. (turn_to satellite1 star5 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star5)
   changed: (fuel satellite1) from 30.93 to 15.96, (fuel-used) from 110.07 to 125.04
   goals met: 2 of 6
21. (take_image satellite1 star5 instrument2 infrared2)
   added: (have_image star5 infrared2)
   changed: (data_capacity satellite1) from 903 to 684, (data-stored) from 97 to 316
   goals met: 3 of 6
22. (turn_to satellite1 star2 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 15.96 to 7.732, (fuel-used) from 125.04 to 133.268
   goals met: 3 of 6
23. (turn_to satellite1 phenomenon9 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon9)
   changed: (fuel satellite1) from 7.732 to 1.817, (fuel-used) from 133.268 to 139.183
   goals met: 3 of 6
24. (turn_to satellite0 phenomenon6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 129 to 123.612, (fuel-used) from 139.183 to 144.571
   goals met: 3 of 6
25. (turn_to satellite0 phenomenon10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 123.612 to 118.224, (fuel-used) from 144.571 to 149.959
   goals met: 3 of 6
26. (turn_to satellite0 phenomenon6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 118.224 to 112.836, (fuel-used) from 149.959 to 155.347
   goals met: 3 of 6
27. (turn_to satellite0 phenomenon10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 112.836 to 107.448, (fuel-used) from 155.347 to 160.735
   goals met: 3 of 6
28. (turn_to satellite0 phenomenon6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 107.448 to 102.06, (fuel-used) from 160.735 to 166.123
   goals met: 3 of 6
29. (turn_to satellite0 phenomenon10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 102.06 to 96.672, (fuel-used) from 166.123 to 171.511
   goals met: 3 of 6
30. (turn_to satellite0 phenomenon6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 96.672 to 91.284, (fuel-used) from 171.511 to 176.899
   goals met: 3 of 6
31. (turn_to satellite0 phenomenon10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 91.284 to 85.896, (fuel-used) from 176.899 to 182.287
   goals met: 3 of 6
32. (turn_to satellite0 phenomenon6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 85.896 to 80.508, (fuel-used) from 182.287 to 187.675
   goals met: 3 of 6
33. (turn_to satellite0 phenomenon10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 80.508 to 75.12, (fuel-used) from 187.675 to 193.063
   goals met: 3 of 6
34. (turn_to satellite0 phenomenon6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 75.12 to 69.732, (fuel-used) from 193.063 to 198.451
   goals met: 3 of 6
35. (turn_to satellite0 phenomenon10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 69.732 to 64.344, (fuel-used) from 198.451 to 203.839
   goals met: 3 of 6
36. (turn_to satellite0 phenomenon6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 64.344 to 58.956, (fuel-used) from 203.839 to 209.227
   goals met: 3 of 6
37. (turn_to satellite0 phenomenon10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 58.956 to 53.568, (fuel-used) from 209.227 to 214.615
   goals met: 3 of 6
38. (take_image satellite1 phenomenon9 instrument2 infrared2)
   added: (have_image phenomenon9 infrared2)
   changed: (data_capacity satellite1) from 684 to 539, (data-stored) from 316 to 461
   goals met: 4 of 6
39. (turn_to satellite0 phenomenon6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 53.568 to 48.18, (fuel-used) from 214.615 to 220.003
   goals met: 4 of 6
40. (turn_to satellite0 star0 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 48.18 to 42.967, (fuel-used) from 220.003 to 225.216
   goals met: 4 of 6
41. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 4 of 6
42. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 42.967 to 37.754, (fuel-used) from 225.216 to 230.429
   goals met: 4 of 6
43. (turn_to satellite0 phenomenon10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 37.754 to 32.366, (fuel-used) from 230.429 to 235.817
   goals met: 4 of 6
44. (take_image satellite0 phenomenon10 instrument0 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   changed: (data_capacity satellite0) from 1000 to 712, (data-stored) from 461 to 749
   goals met: 5 of 6
45. (turn_to satellite0 star7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 32.366 to 11.666, (fuel-used) from 235.817 to 256.517
   goals met: 5 of 6
46. (take_image satellite0 star7 instrument0 thermograph3)
   added: (have_image star7 thermograph3)
   changed: (data_capacity satellite0) from 712 to 512, (data-stored) from 749 to 949
   goals met: 6 of 6
